In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'NAZWA': ['JABŁKA', 'GRUSZKI', 'MALINY'],
    'CENA': ['zł 3.22', 'zł 3.22',  'zł 3.22']
})
df

     NAZWA     CENA
0   JABŁKA  zł 3.22
1  GRUSZKI  zł 3.22
2   MALINY  zł 3.22

In [8]:
remove_zl = lambda x: float(x[3:])
df['CENA_W_ZŁ'] = df.CENA.apply(remove_zl)
df

     NAZWA     CENA  CENA_W_ZŁ
0   JABŁKA  zł 3.22       3.22
1  GRUSZKI  zł 3.22       3.22
2   MALINY  zł 3.22       3.22

In [10]:
df = pd.DataFrame({
    'NAZWA': [' JABŁKA', ' GRUSZKI', ' MALINY'],
    'CENA': ['zł 3.22', 'zł 3.22',  'zł 3.22']
})
df

      NAZWA     CENA
0    JABŁKA  zł 3.22
1   GRUSZKI  zł 3.22
2    MALINY  zł 3.22

In [11]:
df.NAZWA.values

array([' JABŁKA', ' GRUSZKI', ' MALINY'], dtype=object)

In [12]:
df.NAZWA.str.strip().values

array(['JABŁKA', 'GRUSZKI', 'MALINY'], dtype=object)

In [4]:
zmienna = 'zł 3.22'
zmienna

'zł 3.22'

In [6]:
zmienna[3:]

'3.22'

In [16]:
df = pd.DataFrame({
    'Address': ['4860 Sunset Boulevard,San Francisco,California',
                '3055 Paradise Lane,Salt Lake City,Utah',
                '682 Main Street,Detroit,Michigan',
                '9001 Cascade Road,Kansas City,Missouri']
})
# display the dataframe
df

                                          Address
0  4860 Sunset Boulevard,San Francisco,California
1          3055 Paradise Lane,Salt Lake City,Utah
2                682 Main Street,Detroit,Michigan
3          9001 Cascade Road,Kansas City,Missouri

In [18]:
df['Address'].str.split(',', expand=True)

                       0               1           2
0  4860 Sunset Boulevard   San Francisco  California
1     3055 Paradise Lane  Salt Lake City        Utah
2        682 Main Street         Detroit    Michigan
3      9001 Cascade Road     Kansas City    Missouri

In [19]:
data = {
    'Name': ['Microsoft Corporation', 'Google, LLC', 'Tesla, Inc.',\
             'Apple Inc.', 'Netflix, Inc.'],
    'Symbol': ['MSFT', 'GOOG', 'TSLA', 'AAPL', 'NFLX'],
    'Industry': ['Tech', 'Tech', 'Automotive', 'Tech', 'Entertainment'],
    'Shares': [100, 50, 150, 200, 80],
    'Shares2': [1000, 500, 1500, 2000, 800]
}
df = pd.DataFrame(data)
df

                    Name Symbol       Industry  Shares  Shares2
0  Microsoft Corporation   MSFT           Tech     100     1000
1            Google, LLC   GOOG           Tech      50      500
2            Tesla, Inc.   TSLA     Automotive     150     1500
3             Apple Inc.   AAPL           Tech     200     2000
4          Netflix, Inc.   NFLX  Entertainment      80      800

In [20]:
df[df['Shares'] > 100]

          Name Symbol    Industry  Shares  Shares2
2  Tesla, Inc.   TSLA  Automotive     150     1500
3   Apple Inc.   AAPL        Tech     200     2000

In [21]:
df[df['Shares'] == 100]

                    Name Symbol Industry  Shares  Shares2
0  Microsoft Corporation   MSFT     Tech     100     1000

In [22]:
df[df['Shares'] < 100]

            Name Symbol       Industry  Shares  Shares2
1    Google, LLC   GOOG           Tech      50      500
4  Netflix, Inc.   NFLX  Entertainment      80      800

In [23]:
df[df['Shares'] != 100]

            Name Symbol       Industry  Shares  Shares2
1    Google, LLC   GOOG           Tech      50      500
2    Tesla, Inc.   TSLA     Automotive     150     1500
3     Apple Inc.   AAPL           Tech     200     2000
4  Netflix, Inc.   NFLX  Entertainment      80      800

In [24]:
#Shares != 100 i shares2 !=500
df[(df['Shares'] != 100) & (df['Shares2'] !=500)]

            Name Symbol       Industry  Shares  Shares2
2    Tesla, Inc.   TSLA     Automotive     150     1500
3     Apple Inc.   AAPL           Tech     200     2000
4  Netflix, Inc.   NFLX  Entertainment      80      800

In [25]:
#Shares != 100 lub shares2 !=500
df[(df['Shares'] != 100) | (df['Shares2'] !=500)]

                    Name Symbol       Industry  Shares  Shares2
0  Microsoft Corporation   MSFT           Tech     100     1000
1            Google, LLC   GOOG           Tech      50      500
2            Tesla, Inc.   TSLA     Automotive     150     1500
3             Apple Inc.   AAPL           Tech     200     2000
4          Netflix, Inc.   NFLX  Entertainment      80      800

In [27]:
#Shares == 100 lub shares2 ==500
df[(df['Shares'] == 100) | (df['Shares2'] ==500)]

                    Name Symbol Industry  Shares  Shares2
0  Microsoft Corporation   MSFT     Tech     100     1000
1            Google, LLC   GOOG     Tech      50      500